Rahix/avr-device/vendor/atmega2560.atdf
      <value-group caption="" name="ANALOG_ADC_PRESCALER">
        <value caption="2" name="VAL_0x00" value="0x00"/>
        <value caption="2" name="VAL_0x01" value="0x01"/>
        <value caption="4" name="VAL_0x02" value="0x02"/>
        <value caption="8" name="VAL_0x03" value="0x03"/>
        <value caption="16" name="VAL_0x04" value="0x04"/>
        <value caption="32" name="VAL_0x05" value="0x05"/>
        <value caption="64" name="VAL_0x06" value="0x06"/>
        <value caption="128" name="VAL_0x07" value="0x07"/>
      </value-group>
      <value-group caption="" name="ANALOG_ADC_AUTO_TRIGGER">
        <value caption="Free Running mode" name="VAL_0x00" value="0x00"/>
        <value caption="Analog Comparator" name="VAL_0x01" value="0x01"/>
        <value caption="External Interrupt Request 0" name="VAL_0x02" value="0x02"/>
        <value caption="Timer/Counter0 Compare Match A" name="VAL_0x03" value="0x03"/>
        <value caption="Timer/Counter0 Overflow" name="VAL_0x04" value="0x04"/>
        <value caption="Timer/Counter1 Compare Match B" name="VAL_0x05" value="0x05"/>
        <value caption="Timer/Counter1 Overflow" name="VAL_0x06" value="0x06"/>
        <value caption="Timer/Counter1 Capture Event" name="VAL_0x07" value="0x07"/>
      </value-group>
    </module>
    <module caption="Bootloader" name="BOOT_LOAD">
      <register-group caption="Bootloader" name="BOOT_LOAD">
        <register caption="Store Program Memory Control Register" name="SPMCSR" offset="0x57" size="1">
          <bitfield caption="SPM Interrupt Enable" mask="0x80" name="SPMIE"/>
          <bitfield caption="Read While Write Section Busy" mask="0x40" name="RWWSB"/>
          <bitfield caption="Signature Row Read" mask="0x20" name="SIGRD"/>
          <bitfield caption="Read While Write section read enable" mask="0x10" name="RWWSRE"/>
          <bitfield caption="Boot Lock Bit Set" mask="0x08" name="BLBSET"/>
          <bitfield caption="Page Write" mask="0x04" name="PGWRT"/>
          <bitfield caption="Page Erase" mask="0x02" name="PGERS"/>
          <bitfield caption="Store Program Memory Enable" mask="0x01" name="SPMEN"/>
        </register>
      </register-group>
    </module>
  </modules>
  <pinouts>
    <pinout name="TQFP100" caption="TQFP100">
      <pin position="1" pad="PG5"/>
      <pin position="2" pad="PE0"/>
      <pin position="3" pad="PE1"/>
      <pin position="4" pad="PE2"/>
      <pin position="5" pad="PE3"/>
      <pin position="6" pad="PE4"/>
      <pin position="7" pad="PE5"/>
      <pin position="8" pad="PE6"/>
      <pin position="9" pad="PE7"/>
      <pin position="10" pad="VCC"/>
      <pin position="11" pad="GND"/>
      <pin position="12" pad="PH0"/>
      <pin position="13" pad="PH1"/>
      <pin position="14" pad="PH2"/>
      <pin position="15" pad="PH3"/>
      <pin position="16" pad="PH4"/>
      <pin position="17" pad="PH5"/>
      <pin position="18" pad="PH6"/>
      <pin position="19" pad="PB0"/>
      <pin position="20" pad="PB1"/>
      <pin position="21" pad="PB2"/>
      <pin position="22" pad="PB3"/>
      <pin position="23" pad="PB4"/>
      <pin position="24" pad="PB5"/>
      <pin position="25" pad="PB6"/>
      <pin position="26" pad="PB7"/>
      <pin position="27" pad="PH7"/>
      <pin position="28" pad="PG3"/>
      <pin position="29" pad="PG4"/>
      <pin position="30" pad="RESET"/>
      <pin position="31" pad="VCC"/>
      <pin position="32" pad="GND"/>
      <pin position="33" pad="XTAL2"/>
      <pin position="34" pad="XTAL1"/>
      <pin position="35" pad="PL0"/>
      <pin position="36" pad="PL1"/>
      <pin position="37" pad="PL2"/>
      <pin position="38" pad="PL3"/>
      <pin position="39" pad="PL4"/>
      <pin position="40" pad="PL5"/>
      <pin position="41" pad="PL6"/>
      <pin position="42" pad="PL7"/>
      <pin position="43" pad="PD0"/>
      <pin position="44" pad="PD1"/>
      <pin position="45" pad="PD2"/>
      <pin position="46" pad="PD3"/>
      <pin position="47" pad="PD4"/>
      <pin position="48" pad="PD5"/>
      <pin position="49" pad="PD6"/>
      <pin position="50" pad="PD7"/>
      <pin position="51" pad="PG0"/>
      <pin position="52" pad="PG1"/>
      <pin position="53" pad="PC0"/>
      <pin position="54" pad="PC1"/>
      <pin position="55" pad="PC2"/>
      <pin position="56" pad="PC3"/>
      <pin position="57" pad="PC4"/>
      <pin position="58" pad="PC5"/>
      <pin position="59" pad="PC6"/>
      <pin position="60" pad="PC7"/>
      <pin position="61" pad="VCC"/>
      <pin position="62" pad="GND"/>
      <pin position="63" pad="PJ0"/>
      <pin position="64" pad="PJ1"/>
      <pin position="65" pad="PJ2"/>
      <pin position="66" pad="PJ3"/>
      <pin position="67" pad="PJ4"/>
      <pin position="68" pad="PJ5"/>
      <pin position="69" pad="PJ6"/>
      <pin position="70" pad="PG2"/>
      <pin position="71" pad="PA7"/>
      <pin position="72" pad="PA6"/>
      <pin position="73" pad="PA5"/>
      <pin position="74" pad="PA4"/>
      <pin position="75" pad="PA3"/>
      <pin position="76" pad="PA2"/>
      <pin position="77" pad="PA1"/>
      <pin position="78" pad="PA0"/>
      <pin position="79" pad="PJ7"/>
      <pin position="80" pad="VCC"/>
      <pin position="81" pad="GND"/>
      <pin position="82" pad="PK7"/>
      <pin position="83" pad="PK6"/>
      <pin position="84" pad="PK5"/>
      <pin position="85" pad="PK4"/>
      <pin position="86" pad="PK3"/>
      <pin position="87" pad="PK2"/>
      <pin position="88" pad="PK1"/>
      <pin position="89" pad="PK0"/>
      <pin position="90" pad="PF7"/>
      <pin position="91" pad="PF6"/>
      <pin position="92" pad="PF5"/>
      <pin position="93" pad="PF4"/>
      <pin position="94" pad="PF3"/>
      <pin position="95" pad="PF2"/>
      <pin position="96" pad="PF1"/>
      <pin position="97" pad="PF0"/>
      <pin position="98" pad="AREF"/>
      <pin position="99" pad="GND"/>
      <pin position="100" pad="AVCC"/>
    </pinout>
    <pinout name="CBGA100" caption="CBGA100">
      <pin position="A1" pad="GND"/>
      <pin position="A2" pad="AREF"/>
      <pin position="A3" pad="PF0"/>
      <pin position="A4" pad="PF5"/>
      <pin position="A5" pad="PE3"/>
      <pin position="A6" pad="PK0"/>
      <pin position="A7" pad="PK3"/>
      <pin position="A8" pad="PK6"/>
      <pin position="A9" pad="GND"/>
      <pin position="A10" pad="VCC"/>
      <pin position="B1" pad="AVCC"/>
      <pin position="B2" pad="PG5"/>
      <pin position="B3" pad="PF1"/>
      <pin position="B4" pad="PF3"/>
      <pin position="B5" pad="PF6"/>
      <pin position="B6" pad="PK1"/>
      <pin position="B7" pad="PK4"/>
      <pin position="B8" pad="PK7"/>
      <pin position="B9" pad="PA0"/>
      <pin position="B10" pad="PA2"/>
      <pin position="C1" pad="PE2"/>
      <pin position="C2" pad="PE0"/>
      <pin position="C3" pad="PE1"/>
      <pin position="C4" pad="PF4"/>
      <pin position="C5" pad="PF7"/>
      <pin position="C6" pad="PK2"/>
      <pin position="C7" pad="PK5"/>
      <pin position="C8" pad="PJ7"/>
      <pin position="C9" pad="PA1"/>
      <pin position="C10" pad="PA3"/>
      <pin position="D1" pad="PE3"/>
      <pin position="D2" pad="PE4"/>
      <pin position="D3" pad="PE5"/>
      <pin position="D4" pad="PE6"/>
      <pin position="D5" pad="PH2"/>
      <pin position="D6" pad="PA4"/>
      <pin position="D7" pad="PA5"/>
      <pin position="D8" pad="PA6"/>
      <pin position="D9" pad="PA7"/>
      <pin position="D10" pad="PG2"/>
      <pin position="E1" pad="PE7"/>
      <pin position="E2" pad="PH0"/>
      <pin position="E3" pad="PH1"/>
      <pin position="E4" pad="PH3"/>
      <pin position="E5" pad="PH5"/>
      <pin position="E6" pad="PJ6"/>
      <pin position="E7" pad="PJ5"/>
      <pin position="E8" pad="PJ4"/>
      <pin position="E9" pad="PJ3"/>
      <pin position="E10" pad="PJ2"/>
      <pin position="F1" pad="VCC"/>
      <pin position="F2" pad="PH4"/>
      <pin position="F3" pad="PH6"/>
      <pin position="F4" pad="PB0"/>
      <pin position="5F" pad="PL4"/>
      <pin position="F6" pad="PD1"/>
      <pin position="F7" pad="PJ1"/>
      <pin position="F8" pad="PJ0"/>
      <pin position="F9" pad="PC7"/>
      <pin position="F10" pad="GND"/>
      <pin position="G1" pad="GND"/>
      <pin position="G2" pad="PB1"/>
      <pin position="G3" pad="PB2"/>
      <pin position="G4" pad="PB5"/>
      <pin position="G5" pad="PL2"/>
      <pin position="G6" pad="PD0"/>
      <pin position="G7" pad="PD5"/>
      <pin position="G8" pad="PC5"/>
      <pin position="G9" pad="PC6"/>
      <pin position="G10" pad="VCC"/>
      <pin position="H1" pad="PB3"/>
      <pin position="H2" pad="PB4"/>
      <pin position="H3" pad="RESET"/>
      <pin position="H4" pad="PL1"/>
      <pin position="H5" pad="PL3"/>
      <pin position="H6" pad="PL7"/>
      <pin position="H7" pad="PD4"/>
      <pin position="H8" pad="PC4"/>
      <pin position="H9" pad="PC3"/>
      <pin position="H0" pad="PC2"/>
      <pin position="I1" pad="PH7"/>
      <pin position="I2" pad="PG3"/>
      <pin position="I3" pad="PB6"/>
      <pin position="I4" pad="PL0"/>
      <pin position="I5" pad="XTAL2"/>
      <pin position="I6" pad="PL6"/>
      <pin position="I7" pad="PD3"/>
      <pin position="I8" pad="PC1"/>
      <pin position="I9" pad="PC0"/>
      <pin position="I0" pad="PG1"/>
      <pin position="J1" pad="PB7"/>
      <pin position="J2" pad="PG4"/>
      <pin position="J3" pad="VCC"/>
      <pin position="J4" pad="GND"/>
      <pin position="J5" pad="XTAL1"/>
      <pin position="J6" pad="PL5"/>
      <pin position="J7" pad="PD2"/>
      <pin position="J8" pad="PD6"/>
      <pin position="J9" pad="PD7"/>
      <pin position="J10" pad="PG0"/>
    </pinout>
  </pinouts>
</avr-tools-device-file>